benchmarks/results/20260308_235501/03_chat_messages.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarks/chat_load.js
        output: json (benchmarks/results/20260308_235501/03_chat_messages.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-03-08T23:57:03+05:30" level=info msg="[setup] Ready — conversationId=8" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1/1 VUs  0m00.5s/1m00.0s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1/1 VUs  0m01.5s/1m00.0s

running (0m03.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 1/1 VUs  0m02.5s/1m00.0s

running (0m04.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 1/1 VUs  0m03.5s/1m00.0s

running (0m05.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 1/1 VUs  0m04.5s/1m00.0s

running (0m06.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [   9% ] 1/1 VUs  0m05.5s/1m00.0s

running (0m07.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  11% ] 1/1 VUs  0m06.5s/1m00.0s

running (0m08.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  12% ] 1/1 VUs  0m07.5s/1m00.0s

running (0m09.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  14% ] 1/1 VUs  0m08.5s/1m00.0s

running (0m10.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  16% ] 1/1 VUs  0m09.5s/1m00.0s

running (0m11.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  17% ] 1/1 VUs  0m10.5s/1m00.0s

running (0m12.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  19% ] 1/1 VUs  0m11.5s/1m00.0s

running (0m13.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  21% ] 1/1 VUs  0m12.5s/1m00.0s

running (0m14.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  22% ] 1/1 VUs  0m13.5s/1m00.0s

running (0m15.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  24% ] 1/1 VUs  0m14.5s/1m00.0s

running (0m16.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  26% ] 1/1 VUs  0m15.5s/1m00.0s

running (0m17.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  27% ] 1/1 VUs  0m16.5s/1m00.0s

running (0m18.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  29% ] 1/1 VUs  0m17.5s/1m00.0s

running (0m19.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  31% ] 1/1 VUs  0m18.5s/1m00.0s

running (0m20.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  32% ] 1/1 VUs  0m19.5s/1m00.0s

running (0m21.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  34% ] 1/1 VUs  0m20.5s/1m00.0s

running (0m22.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  36% ] 1/1 VUs  0m21.5s/1m00.0s

running (0m23.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  37% ] 1/1 VUs  0m22.5s/1m00.0s

running (0m24.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  39% ] 1/1 VUs  0m23.5s/1m00.0s

running (0m25.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  41% ] 1/1 VUs  0m24.5s/1m00.0s

running (0m26.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  42% ] 1/1 VUs  0m25.5s/1m00.0s

running (0m27.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  44% ] 1/1 VUs  0m26.5s/1m00.0s

running (0m28.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  46% ] 1/1 VUs  0m27.5s/1m00.0s

running (0m29.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  47% ] 1/1 VUs  0m28.5s/1m00.0s

running (0m30.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  49% ] 1/1 VUs  0m29.5s/1m00.0s

running (0m31.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  51% ] 1/1 VUs  0m30.5s/1m00.0s

running (0m32.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  52% ] 1/1 VUs  0m31.5s/1m00.0s

running (0m33.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  54% ] 1/1 VUs  0m32.5s/1m00.0s

running (0m34.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  56% ] 1/1 VUs  0m33.5s/1m00.0s

running (0m35.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  57% ] 1/1 VUs  0m34.5s/1m00.0s

running (0m36.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  59% ] 1/1 VUs  0m35.5s/1m00.0s

running (0m37.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  61% ] 1/1 VUs  0m36.5s/1m00.0s

running (0m38.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  62% ] 1/1 VUs  0m37.5s/1m00.0s

running (0m39.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  64% ] 1/1 VUs  0m38.5s/1m00.0s

running (0m40.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  66% ] 1/1 VUs  0m39.5s/1m00.0s

running (0m41.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 1/1 VUs  0m40.5s/1m00.0s

running (0m42.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
default   [  69% ] 1/1 VUs  0m41.5s/1m00.0s

running (0m43.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
default   [  71% ] 1/1 VUs  0m42.5s/1m00.0s

running (0m44.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
default   [  72% ] 1/1 VUs  0m43.5s/1m00.0s

running (0m45.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  74% ] 1/1 VUs  0m44.5s/1m00.0s

running (0m46.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  76% ] 1/1 VUs  0m45.5s/1m00.0s

running (0m47.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [  77% ] 1/1 VUs  0m46.5s/1m00.0s

running (0m48.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [  79% ] 1/1 VUs  0m47.5s/1m00.0s

running (0m49.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  81% ] 1/1 VUs  0m48.5s/1m00.0s

running (0m50.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  82% ] 1/1 VUs  0m49.5s/1m00.0s

running (0m51.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  84% ] 1/1 VUs  0m50.5s/1m00.0s

running (0m52.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  86% ] 1/1 VUs  0m51.5s/1m00.0s

running (0m53.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  87% ] 1/1 VUs  0m52.5s/1m00.0s

running (0m54.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  89% ] 1/1 VUs  0m53.5s/1m00.0s

running (0m55.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  91% ] 1/1 VUs  0m54.5s/1m00.0s

running (0m56.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  92% ] 1/1 VUs  0m55.5s/1m00.0s

running (0m57.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  94% ] 1/1 VUs  0m56.5s/1m00.0s

running (0m58.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  96% ] 1/1 VUs  0m57.5s/1m00.0s

running (0m59.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
default   [  97% ] 1/1 VUs  0m58.5s/1m00.0s

running (1m00.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
default   [  99% ] 1/1 VUs  0m59.5s/1m00.0s

     ✗ POST .../messages → 200 or 201
      ↳  0% — ✓ 0 / ✗ 30
     ✗ POST .../messages → has content
      ↳  0% — ✓ 0 / ✗ 30
     ✓ POST .../messages → p95 <3500ms

     █ setup

       ✓ setup: login 200
       ✓ setup: token present
       ✓ setup: conversation 201
       ✓ setup: conversation id present

     checks.........................: 36.17%  34 out of 94
     data_received..................: 6.0 kB  99 B/s
     data_sent......................: 13 kB   220 B/s
     http_req_blocked...............: avg=306.94µs min=6.92µs  med=290.95µs max=945.04µs p(50)=290.95µs p(95)=409.54µs p(99)=789.37µs
     http_req_connecting............: avg=207.75µs min=0s      med=205.66µs max=424.81µs p(50)=205.66µs p(95)=298.7µs  p(99)=396.24µs
     http_req_duration..............: avg=26.78ms  min=2.44ms  med=11.02ms  max=506.99ms p(50)=11.02ms  p(95)=21.37ms  p(99)=353.46ms
       { expected_response:true }...: avg=262.22ms min=17.46ms med=262.22ms max=506.99ms p(50)=262.22ms p(95)=482.51ms p(99)=502.09ms
     ✓ { name:chat_message }........: avg=11.9ms   min=10.01ms med=10.77ms  max=27.23ms  p(50)=10.77ms  p(95)=16.1ms   p(99)=24.1ms  
     http_req_failed................: 93.93%  31 out of 33
     ✗ { name:chat_message }........: 100.00% 30 out of 30
     http_req_receiving.............: avg=150.51µs min=81.86µs med=150.69µs max=276.51µs p(50)=150.69µs p(95)=199.93µs p(99)=254.19µs
     http_req_sending...............: avg=85.7µs   min=32.78µs med=82.34µs  max=144.7µs  p(50)=82.34µs  p(95)=135.17µs p(99)=143.38µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(50)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=26.54ms  min=2.2ms   med=10.79ms  max=506.76ms p(50)=10.79ms  p(95)=21.15ms  p(99)=353.24ms
     http_reqs......................: 33      0.541618/s
     iteration_duration.............: avg=2.01s    min=2.01s   med=2.01s    max=2.02s    p(50)=2.01s    p(95)=2.01s    p(99)=2.02s   
     iterations.....................: 30      0.49238/s
     vus............................: 1       min=1        max=1
     vus_max........................: 1       min=1        max=1


running (1m00.9s), 0/1 VUs, 30 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  1m0s
time="2026-03-08T23:58:04+05:30" level=error msg="thresholds on metrics 'http_req_failed{name:chat_message}' have been crossed"